log/111111/20220415171628/disk1.log
========= Data Disk NO.1 Read And Write Begin  2022-04-15 17:16:31 ==========
The Command Line ->>> ./tools/fio -filename=/dev/sdc -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=1G -numjobs=10 -runtime=600 -group_reporting -time_based -name=mytest_1

mytest_1: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_1: (groupid=0, jobs=10): err= 0: pid=79197: Fri Apr 15 17:26:32 2022
  read: IOPS=13.2k, BW=206MiB/s (216MB/s)(121GiB/600001msec)
    clat (usec): min=90, max=31344, avg=506.47, stdev=138.71
     lat (usec): min=90, max=31344, avg=506.71, stdev=138.72
    clat percentiles (usec):
     |  1.00th=[  306],  5.00th=[  347], 10.00th=[  371], 20.00th=[  408],
     | 30.00th=[  437], 40.00th=[  457], 50.00th=[  482], 60.00th=[  506],
     | 70.00th=[  537], 80.00th=[  594], 90.00th=[  676], 95.00th=[  758],
     | 99.00th=[  889], 99.50th=[  930], 99.90th=[ 1090], 99.95th=[ 1876],
     | 99.99th=[ 2737]
   bw (  KiB/s): min=155415, max=232420, per=100.00%, avg=211608.02, stdev=633.46, samples=11980
   iops        : min= 9712, max=14526, avg=13224.46, stdev=39.62, samples=11980
  write: IOPS=13.2k, BW=206MiB/s (216MB/s)(121GiB/600001msec); 0 zone resets
    clat (usec): min=55, max=19695, avg=241.88, stdev=85.12
     lat (usec): min=55, max=19722, avg=243.91, stdev=85.54
    clat percentiles (usec):
     |  1.00th=[   73],  5.00th=[  105], 10.00th=[  135], 20.00th=[  176],
     | 30.00th=[  206], 40.00th=[  229], 50.00th=[  251], 60.00th=[  269],
     | 70.00th=[  289], 80.00th=[  310], 90.00th=[  330], 95.00th=[  347],
     | 99.00th=[  375], 99.50th=[  392], 99.90th=[  502], 99.95th=[  660],
     | 99.99th=[ 1221]
   bw (  KiB/s): min=152263, max=242543, per=100.00%, avg=211607.43, stdev=922.53, samples=11980
   iops        : min= 9515, max=15158, avg=13224.41, stdev=57.69, samples=11980
  lat (usec)   : 100=2.16%, 250=22.86%, 500=53.59%, 750=18.78%, 1000=2.51%
  lat (msec)   : 2=0.09%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=2.05%, sys=5.87%, ctx=15872456, majf=0, minf=4889
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7928005,7928033,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=206MiB/s (216MB/s), 206MiB/s-206MiB/s (216MB/s-216MB/s), io=121GiB (130GB), run=600001-600001msec
  WRITE: bw=206MiB/s (216MB/s), 206MiB/s-206MiB/s (216MB/s-216MB/s), io=121GiB (130GB), run=600001-600001msec

Disk stats (read/write):
  sdc: ios=7926496/7926316, merge=0/0, ticks=3860230/1781969, in_queue=5644325, util=100.00%
================== Data disk NO.1 End ====================